// •	Какое будет выведено значение: let x = 5; alert( x++ ); ?
// 5
// •	Чему равно такое выражение: [ ] + false - null + true ?
//  'false - null + true'
// •	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
// 2
// •	Чему равна сумма [ ] + 1 + 2?
// '12'
// •	Что выведет этот код: alert( "1"[0] )?
// indefindet
// •	Чему равно 2 && 1 && null && 0 && undefined ?

// •	Есть ли разница между выражениями? !!( a && b ) и (a && b)?

// •	Что выведет этот код: alert( null || 2 && 3 || 4 ); ?

// •	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?

// •	Что выведет этот код: alert( +"Infinity" ); ?

// •	Верно ли сравнение: "Ёжик" > "яблоко"?

// •	Чему равно 0 || "" || 2 || undefined || true || falsе ?

//console.log(2 && 1 && null && 0 && undefined); 

// оператор && сравнивает равно ли выражение другому и этот оператор всегда остан_ся на лжи и выводит это значение
// оператор || сравнивает равно ли выражение другому и этот оператор всегда стан_ся на правде и выводит это значение

// const a = [1, 2, 3],
//       b = [1, 2, 3];
// console.log(a == b);

// alert( +"Infinity" );
// console.log("Ёжик" > "яблоко");

